// 5. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
int a = 8, b = 9;
if (a * a == b || b * b == a) Console.Write("да");
else Console.Write("нет");