// Задача 1. Заказчик предложил работать с целыми числами и выводить только максимальное
int a = 5;
int b = 7;
if (a > b)
{
    Console.Write("max = ");
    Console.Write(a);
}
else
{
    Console.Write("max = ");
    Console.Write(b);
}