// Задача 3. Написать программу, которая на вход принимает целое число и выдаёт, является ли число чётным (делится ли оно на два без остатка)
int a = 4;
if (a % 2 == 0) Console.Write("Да (четное)");
else Console.Write("Нет (нечетное)");