// Задача 6. Написать программу, которая принимает на вход трёхзначное число и на выходе показывает последнюю цифру этого числа.
int n = 918;
int lastNumber = n % 10;
Console.Write (lastNumber);